app/views/bookmarks/new.html.erb

SELECT "movies".* FROM "movies"
---
<%= form_with model: [@list, @bookmark] do |form| %>
  <%= form.select :movie_id, collection: Movie.all.map { |m| m.id } %>