app/controllers/bookmarks_controller.rb

INSERT INTO "bookmarks" ("comment", "movie_id", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "aejdojadojfefzef"], ["movie_id", 21], ["list_id", 1], ["created_at", "2023-05-26 13:37:27.167381"], ["updated_at", "2023-05-26 13:37:27.167381"]]
---
  def create
    @bookmark = Bookmark.new(bookmark_params)
    if @bookmark.save
      @bookmark.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_list
    @list = List.find(params[:list_id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
---
  def set_movie
    @move = Movie.find(params[:movie_id])