app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Bonjour"], ["created_at", "2023-05-26 13:37:01.571737"], ["updated_at", "2023-05-26 13:37:01.571737"]]
---
  def create
    @list = List.new(list_params)
    if @list.save
      @list.save